# 3.Склонение слова
# Реализовать склонение слова «процент» во фразе «N процентов». Вывести эту фразу на экран отдельной
# строкой для каждого из чисел в интервале от 1 до 100:
# 1 процент
# 2 процента
# 3 процента
# 4 процента
# 5 процентов
# 6 процентов
# ...
# 100 процентов

# Declension of words by numbers
num_1 = [0, 5, 6, 7, 8, 9, 10]
num_2 = [2, 3, 4]
num_3 = [11, 12, 13, 14]
num = 1
while num <= 100:
    if (num % 10 in num_1) or (num in num_3): # 5-20, 25-30, 35-40, ... , 95-100
        print(num, ' процентов')
    elif (num % 10 in num_2): # 2-4, 22-24, 32-34, 42-44, ... , 92-94
        print(num, ' процента')
    else: # else number: 1, 21, 31, 41, ..., 91
        print(num, ' процент')
    num += 1
